load-tests/artillery-config.yml
config:
  target: "http://localhost:3000"
  plugins:
    expect: {}
  phases:
    # Warm-up phase
    - duration: 60
      arrivalRate: 5
      name: "Warm-up - 5 users/sec"
    
    # Ramp-up phase
    - duration: 120
      arrivalRate: 5
      rampTo: 20
      name: "Ramp-up - 5 to 20 users/sec"
    
    # Sustained load phase
    - duration: 180
      arrivalRate: 20
      name: "Sustained load - 20 users/sec"
    
    # Peak load phase
    - duration: 120
      arrivalRate: 20
      rampTo: 50
      name: "Peak load - 20 to 50 users/sec"
    
    # Stress test phase
    - duration: 60
      arrivalRate: 50
      rampTo: 100
      name: "Stress test - 50 to 100 users/sec"
    
    # Cool down phase
    - duration: 60
      arrivalRate: 10
      name: "Cool down - 10 users/sec"

  processor: "./test-data.js"
  
scenarios:
  # Test Scenario 1: Homepage and Dashboard Access
  - name: "Homepage and Dashboard Navigation"
    weight: 30
    flow:
      - get:
          url: "/"
          expect:
            - statusCode: 200
            - contentType: text/html
            - hasHeader: "content-type"
          capture:
            - json: "$"
              as: "pageData"
      
      - think: 2
      
      - get:
          url: "/inspections"
          expect:
            - statusCode: 200

  # Test Scenario 2: Inspection Management
  - name: "Inspection Form Workflow"
    weight: 25
    flow:
      - get:
          url: "/inspections"
          expect:
            - statusCode: 200
      
      - think: 1
      
      - get:
          url: "/inspections/new"
          expect:
            - statusCode: 200
      
      - think: 5
      
      # Simulate form submission (GET for now since we don't have API endpoints)
      - get:
          url: "/inspections"
          expect:
            - statusCode: 200

  # Test Scenario 3: Observations Management
  - name: "Observations Workflow"
    weight: 25
    flow:
      - get:
          url: "/observations"
          expect:
            - statusCode: 200
      
      - think: 1
      
      - get:
          url: "/observations/new"
          expect:
            - statusCode: 200
      
      - think: 3
      
      - get:
          url: "/observations"
          expect:
            - statusCode: 200

  # Test Scenario 4: Incidents Management
  - name: "Incidents Workflow"
    weight: 15
    flow:
      - get:
          url: "/incidents"
          expect:
            - statusCode: 200
      
      - think: 1
      
      - get:
          url: "/incidents/new"
          expect:
            - statusCode: 200
      
      - think: 4
      
      - get:
          url: "/incidents"
          expect:
            - statusCode: 200

  # Test Scenario 5: Settings and Static Resources
  - name: "Settings and Resources"
    weight: 5
    flow:
      - get:
          url: "/settings"
          expect:
            - statusCode: 200
      
      - think: 2
      
      - get:
          url: "/"
          expect:
            - statusCode: 200